UNFOLD = {
    "SITE_TITLE": "IMA Pro Space | Admin",
    "SITE_HEADER": "IMA Pro Space",
    "SITE_SYMBOL": "meeting_room",  # Иконка из Material Symbols
    "SHOW_HISTORY": True,
    "SITE_VERSION": "0.1.0",

    # Кастомизация цветовой палитры (Tailwind CSS значения)
    "COLORS": {
        "primary": {
            "50": "250 250 250",   # Светло-серый (для фонов активных элементов и ховеров)
            "100": "244 244 245",
            "200": "228 228 231",
            "300": "212 212 216",
            "400": "161 161 170",
            "500": "24 24 27",     # Основной черный (кнопки, активные ссылки, чекбоксы)
            "600": "39 39 42",
            "700": "63 63 70",
            "800": "39 39 42",
            "900": "24 24 27",
            "950": "9 9 11",       # Глубокий черный
        },
    },
}